MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK30DX128VLK7/mcu.h
#define SP0                           0x40000000      // Supervisor Protect
#define WP0                           0x20000000      // Write protect
#define TP0                           0x10000000      // Trusted Protect
#define SP1                           0x04000000      // Supervisor Protect
#define WP1                           0x02000000      // Write Protect
#define TP1                           0x01000000      // Trusted protect
#define SP2                           0x00400000      // Supervisor Protect
#define WP2                           0x00200000      // Write protect
#define TP2                           0x00100000      // Trusted Protect
#define SP3                           0x00040000      // Supervisor protect
#define WP3                           0x00020000      // Write Protect
#define TP3                           0x00010000      // Trusted protect
#define SP4                           0x00004000      // Supervisor Protect
#define WP4                           0x00002000      // Write protect
#define TP4                           0x00001000      // Trusted protect
#define SP5                           0x00000400      // Supervisor Protect
#define WP5                           0x00000200      // Write Protect
#define TP5                           0x00000100      // Trusted Protect
#define SP6                           0x00000040      // Supervisor Protect
#define WP6                           0x00000020      // Write Protect
#define TP6                           0x00000010      // Trusted Protect
#define SP7                           0x00000004      // Supervisor Protect
#define WP7                           0x00000002      // Write Protect
#define TP7                           0x00000001      // Trusted Protect



#endif // __MK30DX128VLK7_H__

